import help_menu from "../ui/menus/help";
import type { MyContext } from "../types/context";

async function help_cmd(ctx: MyContext) {
  await ctx.reply(
    `
🌻Бот статистики Соняшник.
<b>Дізнайтесь статистику та активність у вашому чаті:</b>
    
📊 <b>Статистика:</b> стата вчора, день, тиждень, місяць, рік або весь час.
📈 <b>!я:</b> переглянути власний актив.
📈 <b>!ти:</b> переглянути чужий актив (у відповідь на повідомлення, юзернейм або ім'я).
📉 <b>!інактив X / !неактив X:</b> переглянути сторінку активу чату в порядку від самого старого. (замість X номер сторінки)
🏷 <b>+нік X:</b> встановити бажаний нікнейм (замість X). Видалити нікнейм: -нік.
🫣 <b>!ссприховати:</b> приховати людину (котра вийшла) зі статистики (за ім'ям, юзернеймом або у відповідь на повідомлення).
🧹 <b>!чистка X Y.</b> Наприклад, !чистка 7 100 — мінімум 100 повідомлень за останні 7 днів.
👀 <b>Бот?</b>: Перевірка, чи бот працює. Якщо цього не відбувається, то, скоріш за все, я пішов спати.
    
Слідкувати за оновленнями можна у мене в каналі: soniashnyk.t.me
`,
    {
      disable_notification: true,
      reply_markup: help_menu,
      link_preview_options: { is_disabled: true },
    }
  );
}

export default help_cmd;
