import type { IContext } from "../types/context.js";
import help_menu from "../ui/menus/help.js";

async function help_cmd(ctx: IContext) {
  await ctx
    .reply(
      `
🌻Бот статистики Соняшник.
<b>Дізнайтесь статистику та активність у вашому чаті:</b>

📊 <b>Статистика</b>: стата вчора, день, тиждень, місяць, рік, вся або за датою (наприклад, <code>стата 2024.01.01</code> або <code>стата 2024.01.01 2024.06.01</code>).

📈 <b>!я</b>: переглянути свою статистику.

📈 <b>!ти</b>: переглянути чужу статистику (у відповідь на повідомлення, юзернейм або ім'я).

📉 <b>!інактив X / !неактив X</b>: переглянути сторінку активу чату від найстарішого (замість X номер сторінки).

💅🏻 <b>!стата фон я /setMyBg</b>: Змінити фон для команд !я та !ти (команду потрібно писати в описі до зображення). Працює у всіх чатах.

💅🏻 <b>!стата фон чат /setChatBg</b>: Змінити фон для команд статистики чату (команду потрібно писати в описі до зображення).

🏷 <b>+нік X</b>: встановити бажаний нікнейм (замість X). Видалити нікнейм: -нік.

🧹 <b>!чистка X Y</b>: Наприклад, !чистка 7 100 — мінімум 100 повідомлень за останні 7 днів.

🛏 <b>!рест</b>: захистити людину від чистки (за ім'ям, юзернеймом або у відповідь на повідомлення).

🫣 <b>!ссприховати</b>: приховати людину зі статистики / скинути дату першої появи (за ім'ям, юзернеймом або у відповідь на повідомлення).

📅 <b>!дата вступу</b>: зміна дати вступу.

💸 <b>/refreshDonate</b>: Оновити ваш статус донатера чи чату.

⚙️ <b>!налаштування /settings</b>: Налаштування чату.

👀 <b>Бот?</b>: Перевірка, чи бот працює. Якщо цього не відбувається, то, скоріш за все, я пішов спати.

🖼 Графіки статистики працюють лише для статистики від 3х днів. Якщо ви тільки додали бота, то вони скоро з'являться 😉!

Слідкуйте за оновленнями у моєму каналі: soniashnyk.t.me
`,
      {
        disable_notification: true,
        reply_markup: help_menu,
        link_preview_options: { is_disabled: true },
        reply_parameters: {
          allow_sending_without_reply: true,
          message_id: ctx.msg?.message_id ?? -1,
        },
      }
    )
    .catch((e) => {});
}

export default help_cmd;
