import { MyContext } from "../types/context";
import help_menu from "../ui/menus/help";

function help_cmd(ctx: MyContext) {
  ctx.reply(
    `
Привіт! Я — новий бот для статистики із сім'ї Соняшника. Ось мої команди: 
📊 Стата/статистика вчора/день/тиждень/місяць/вся
!я — власний актив
!ти — чужий актив
!неактив X - замість x потрібне число , неактив за вказаний період днів

Бот? — просто команда, на яку я маю зреагувати. Якщо цього не відбувається, то, скоріш за все, я пішов спати 😴
`,
    { reply_markup: help_menu }
  );
}

export default help_cmd;
