import { MyContext } from "../types/context";
import help_menu from "../ui/menus/help";

function help_cmd(ctx: MyContext) {
  ctx.reply(
    `
Привіт! Я — новий бот для статистики із сім'ї Соняшника. Ось мої команди: 
📊 Стата/статистика вчора/день/тиждень/місяць/рік/вся
!я — власний актив
!ти — чужий актив
!інактив X — замість x номер сторінки
+нік Х, +нікнейм Х — замість х бажаний нікнейм. Відображається замість імені у всіх командах\nМожна видалити -нік

Бот? — просто команда, на яку я маю зреагувати. Якщо цього не відбувається, то, скоріш за все, я пішов спати 😴
`,
    { reply_markup: help_menu, link_preview_options: { is_disabled: true } }
  );
}

export default help_cmd;
